-- 날짜와 타임스탬프 다루기

/*
-- 현재 날짜와 타임스탬프 추출
*/
SELECT
    CURRENT_DATE AS dt
    , CURRENT_TIMESTAMP AS stamp
;
-- +------------+---------------------+
-- | dt         | stamp               |
-- +------------+---------------------+
-- | 2021-11-19 | 2021-11-19 06:42:02 |
-- +------------+---------------------+

/*
-- 문자열을 날짜/타임스탬프로 변환
*/
SELECT
    DATE('2021-11-19') AS dt
    , TIMESTAMP('2021-11-19 15:00:00') AS stamp
;
-- +------------+---------------------+
-- | dt         | stamp               |
-- +------------+---------------------+
-- | 2021-11-19 | 2021-11-19 15:00:00 |
-- +------------+---------------------+

/*
-- 연, 월 등 추출
*/
SELECT
    stamp
    , YEAR(stamp) AS year
    , MONTH(stamp) AS month
    , DAY(stamp) AS day
    , HOUR(stamp) AS hour
FROM 
    (SELECT TIMESTAMP('2021-11-19 16:00:00') AS stamp) AS t
;
-- +---------------------+------+-------+------+------+
-- | stamp               | year | month | day  | hour |
-- +---------------------+------+-------+------+------+
-- | 2021-11-19 16:00:00 | 2021 |    11 |   19 |   16 |
-- +---------------------+------+-------+------+------+

/*
-- 문자열에서 연, 월 등 추출
-- 컬럼명 '_' 넣으면 에러 */
SELECT
    stamp
    , SUBSTRING(stamp, 1, 4) AS year
    , SUBSTRING(stamp, 6, 2) AS month
    , SUBSTRING(stamp, 9, 2) AS day
    , SUBSTRING(stamp, 12, 2) AS hour
    , SUBSTRING(stamp, 1, 7) AS ym
FROM
    (SELECT CAST('2021-11-19 16:00:00' AS CHAR) AS stamp) as t
;
-- +---------------------+------+-------+------+------+---------+
-- | stamp               | year | month | day  | hour | ym      |
-- +---------------------+------+-------+------+------+---------+
-- | 2021-11-19 16:00:00 | 2021 | 11    | 19   | 16   | 2021-11 |
-- +---------------------+------+-------+------+------+---------+